---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.ExternalServiceResult
source: html/63c83d88-92c7-5283-8b39-efb0baeedcd8.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceResult

An enumerated value representing a result from executing an external service.

## Syntax (C#)
```csharp
public enum ExternalServiceResult
```